package com.example.webviewcss

class TestData {
    companion object {
        val data = listOf(
"""
<div class="p-pr-offer-body__highlights">
    <h2>おすすめポイント</h2>
    <ol>
    <li>ほげほげグループ企業</li>
    <li>年間休日124日。巨大グループの福利厚生</li>
    <li>大都市ランドマークや都市再開発に携わる</li>
    </ol>
</div>
山田1640454 太郎1640454様<br>
<br>
こんにちは、エージェントのスカウト担当です。
<br>この度、<span class="p-pr-offer-body__font-red">新たに募集を開始した企業の8月追加推薦枠</span>へご案内いたします。<br><br>推薦でご案内させていただくため<br>
<span class="u-font-bold">”一次面接免除やいきなり最終選考で進める企業もあり、最短1週間での内定獲得”</span>も狙えます。<br><br>
<span class="u-font-bold">◆大手級の待遇例(一部)</span><br><br>
<span class="p-pr-offer-body__under-line">※締め切りが迫っているため、まずはご予約されることをお勧めいたします！</span><br>各企業、募集には期限が設けられているため、後日のエントリーだとご希望に沿った求人がなくなってしまう可能性がございます。
<table class="p-pr-offer-body__outline">
    <caption>募集概要</caption>
    <tbody>
    <tr><th>会社名</th><td>株式会社◯◯</td></tr>
    <tr><th>募集年次</th><td>2024年卒</td></tr>
    <tr><th>募集対象</th><td>2024年度卒業予定の学生</td></tr>
    </tbody>
</table>
""",

            """
<span class="u-font-bold">フューチャーグロウス株式会社へようこそ！</span><br>
<br>
未来を拓くリーディングカンパニー、フューチャーグロウス株式会社への就職活動に興味をお持ちいただき、ありがとうございます。<br>
<br>
当社は常に最先端の技術と革新的なアイデアを活用し、世界を変えるプロジェクトに取り組んでいます。我々は卓越した才能と熱意あるチームプレイヤーを求めており、一緒に未来を築いていく仲間を募集しています。<br>
<br>
<span class="u-font-bold">なぜフューチャーグロウス？</span><br>
<br>
挑戦と成長の機会:
フューチャーグロウスでは、日々の業務が新たなチャレンジと成長の機会となります。常に最新の技術や手法に触れながら、自己成長を遂げましょう。<br>
<br>
クリエイティブな環境:
当社は創造性を尊重し、新しいアイデアを歓迎します。自分の考えを形にし、革新的なソリューションを生み出す環境がここにあります。<br>
<br>
使命感と社会貢献:
私たちのプロジェクトは、社会に意義のあるものです。自分の力で世界をより良くする使命に共感できる方を歓迎します。<br>
<br>

熱意と向上心:
常に学び、成長し続ける姿勢を持っている方を求めています。<br>
<br>
チームワークの能力:
グローバルなチームでの連携が求められます。コミュニケーションスキルが高く、他者と協力し合える方を歓迎します。<br>
<br>
技術的な鋭さ:
技術的な知識やスキルを持ち、最新のトレンドやツールに対応できる方を求めています。<br>
<br>

オンライン応募:
弊社ウェブサイトより応募フォームを記入してください。<br>
<br>
面接:
書類選考を通過した方には、面接の機会を設けます。<br>
<br>
選考結果通知:
面接後、合否についてはできるだけ早くご連絡いたします。

フューチャーグロウス株式会社でのキャリアは、あなたの夢や志向を形にし、未来を築く重要な一歩となるでしょう。私たちはあなたの参加を心待ちにしています。<br>

一緒に未来を創造しましょう！<br>

この文は架空の企業「フューチャーグロウス株式会社」を想定して作成されたものです。
""",

            """
１行だけのテキスト
"""
        )
    }
}